[
  {
    "path": "posts/2021-05-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Sng Kah Leong",
        "url": "https://app.netlify.com/teams/danielsng07"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below.\r\n Figure 1: Chart of original visualisation\r\nThe data visualisation above is created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\n1.1 Clarity\r\nS/N\r\nCritiques\r\n1\r\nThe Area charts is inconsistent with the Chart Title. The title indicate the period of data is from 2019-2020, however some area charts show data from 2019-2021 and for the Japan chart, the data is only for 2020.\r\n2\r\nThe Dual Axis Charts may mislead readers as the y-axis shows different scales for the exports and imports data. Dual Axis Charts may create misrepresentation visually and resulting readers to interpret the charts wrongly.\r\n3\r\nThe Area Charts show overlapping between the exports and imports data resulting in three colours tones. This make it hard for the readers to interpret the charts to see how the values have changes over time.\r\n4\r\nMonth of period is stated in the X Axis Title and it did not specify which months are the data being derived from\r\n5\r\nThere is no explanation or commentary to suggest how the reader read this Chart as the Chart title is very general.\r\n1.2 Aesthetic\r\nS/N\r\nCritiques\r\n1\r\nThe usage of colour in the area charts does not look appealing and visually the blue and yellow colour resulting in a overlapping colour which is brownish. The brownish area was not accounted for in the legends on what it is represented for.\r\n2\r\nThe country names are not aligned in the centre of each area chart which may make readers hard to visualise which chart is represented by which country.\r\n3\r\nThe country names font size are bigger than the title font and this bring the focus of the reader away from the chart title which should be the main focus.\r\n4\r\nThe grid lines and tick marks are missing to help the reader to refer to the Axis labels.\r\n2.0 Proposed Design\r\n2.1 The sketch of proposed design can be seen below.\r\n Figure 2: proposed design sketches\r\n2.2 Advantages of proposed design\r\nClarity\r\nProvide a clearer Chart title to explain the data is based on imports and exports of top six trading countries.\r\nTo provide a short commentary to provide more insights on explaining the proposed new visualization\r\nUse of line chart to better illustrate time series data\r\nUse single Y Axis with same scale for all the charts to better represent the data\r\nEvery Chart to visualize data from 2019 to 2020 as compared to the original visualisation\r\nTo propose X Axis to be quarterly time scale to show seasonal trends\r\nAesthetic\r\nUse of two colour (red and blue), one to represent imports and the other to represent exports to make viewing more clearer and consistent across all charts\r\nAnnotations are used to emphasize key observations per chart\r\nAlign the country name properly per chart\r\n3.0 Proposed Visualisation\r\n Figure 3. The revamp visualization\r\nPlease view the interactive visualisation on Tableau Public here.\r\n4.0 Step-by-step on Preparation\r\nStep 1 - Data Preparation\r\nDownload and extract relevant data in Excel to prepare data\r\nThe original raw data can be seen below.\r\n Figure 4a. Image of raw data in excel\r\nExtracting relevant data in worksheet T1 (merchandise Imports)\r\nClean up is done in excel with the following steps:\r\nS/N\r\nAction\r\n1\r\nRemoving Total merchandise import in T1 worksheet\r\n2\r\nRemoving Subject, Title, Topic\r\n3\r\nThe data from 1976 Jan to 2018 Dec and 2021 Jan to 2021 April are all removed\r\n4\r\nThe country are all removed except Hong Kong, Japan, Malaysia, Mainland China, United States and Taiwan\r\n5\r\nThe country names are renamed as Hong Kong Imports, Japan Imports, Malaysia Imports, Mainland China Imports, United States Imports and Taiwan Imports. (Thousand Dollars are all removed from country name as the currency format are all the same for these 6 countries)\r\n6\r\nRenamed Column A as Country\r\nThe extracted data from T1 worksheet can be seen below.\r\n Figure 4b. Image of raw data in excel\r\nExtracting relevant data in worksheet T2 (merchandise Exports)\r\nThe same steps are repeated for worksheet T2 and country renames as Hong Kong Exports, Japan Exports, Malaysia Exports, Mainland China Exports, United States Exports and Taiwan Exports.\r\nThe Imports and Exports data are then combined into one worksheet.\r\nThe combined worksheet can be seen below.\r\n Figure 5. Image of raw data in excel\r\nThe Transpose function in excel is used to transpose columns to rows in the combined worksheet\r\nThe data cleaned worksheet can be seen below.\r\nImage 1  Figure 6. Image of raw data in excel\r\nImage 2 (includes the hidden country)  Figure 7. Image of raw data in excel\r\nStep 2 - Importing cleaned Data into Tableau Desktop (Professional Edition 64 bits)\r\nBring up Summary Imports Exports worksheet into the Data Source to be used for creating the Visualisation  Figure 8. Importing data into Tableau\r\nStep 3 - Change Data Type of Variable Year Month\r\nIn the worksheet Tab 1, we will change the data type of Year Month from String format to Date format. This enable us to use **Year Month\"\" as a dimension variable for time series data.\r\n Figure 9. Changing data type of variable\r\nStep 4 - Creating the first chart - Hong Kong Merchanise Trade from 2019-2020\r\nFirstly, we will place the dimension variable Year Month into Columns and measure variable Hong Kong Exports into Rows that can be seen below.\r\n Figure 10. Hong Kong Worksheet visual designing process\r\nWe will then selected continous line chart from show me chart selection that can be seen below.\r\n Figure 11. Hong Kong worksheet visual designing process\r\nWe will place measure variable Hong Hong Imports into Y Axis that can be seen below.\r\n Figure 12. inserting Hong Kong imports in Y Axis\r\nNow there is two lines in the chart, one representing Hong Kong exports and the other representing Hong Kong imports that can be seen below.\r\n Figure 13. Display of continuous line chart with imports and exports data of Hong Kong\r\nWe will proceed to change Year Month into Quarter continuous format to view the seasonality trend of the data.\r\n Figure 14. Changing Dimension variable Year Month into Quarter continous format\r\nNow we can see some seasonality trend from the line chart as shown below, we will proceed to edit the colour of the line chart to make the chart easier to read.\r\n Figure 15. View of the seasonal trends in the line chart\r\nWe decided to go with Red Colour for Hong Kong Exports and Blue colour for Hong Kong Imports.\r\n Figure 16. setting two colour (red and blue) in the line chart\r\nNext I will format the grid line, axis rulers to darken the axis line so that the line Chart will look neater.\r\n Figure 17. Ready to format the grid line and axis line\r\nFormatting the Grid line with the settings that can be seen below. This enable reader to reference to the axis label easily.\r\n Figure 18. Edit Settings of grid lines\r\nFormatting the axis rulers with the settings that can be seen below. This help to the reader to view the axis range clearly.\r\n Figure 19. Edit settings of Axis Rulers\r\nNext, i will work on the X axis to bold the X axis label and follow up editing the X axis to remove the axis title as it is self explanatory with the date labels shown.\r\n Figure 20. Formatting X Axis\r\n Figure 21. Bold the Axis Label\r\n Figure 22. Result after Axis label have been bold\r\nEditing the X axis to remove the title and setting the Tick Mark to both X and Y axis so that the corresponding values can easily reference by the reader.\r\n Figure 23. Ready to edit X axis\r\nRemoving the title on the X axis\r\n Figure 24. Removing X Axis Title\r\nFormatting the Axis Ticks on X axis as seen below.This help to provide a reference to the label and this is important for a line chart so that the axis label can be reference by the reader.\r\n Figure 25. Edit settings of the Axis Ticks\r\nNext I will format the Y axis with the same steps we did for X axis by formatting the Y Axis and we will also edit the Y axis to remove the axis title. Thereafter we will follow up by editing the chart title.\r\nThe result of the formatting and editing of both axis can be seen below.The chart now have a clean look showing the trend of the line chart and now i will give the chart a title to represent it properly.\r\nWe will proceed to edit the chart title. As seen below, the result of the formatting and editing both the X and Y axis.\r\n Figure 26. Result after formatting Y axis and ready to edit chart title\r\nWe will just proceed to give the chart name as Hong Kong Merchandise Trade and we will insert the dimenstion variable <QUARTER(Year Month)> in the chart title.\r\n Figure 27. Editing the Chart Title\r\nStep 5 - We will proceed to create the line charts for Mainland China, Japan, Malaysia, Taiwan and United State using the same steps in creating the Hong Kong Line Chart\r\nFirstly, we will duplicate the Hong Kong worksheet to create the other country line chart by editing the filter measure name as follow.\r\nDuplicating the Hong Hong Worksheet*\r\n Figure 28. Duplicating Hong Kong worksheet\r\nNext we will use Edit Filter to select the measure values for the other country as seen below.\r\n Figure 29. Using Edit filter to prepare visual for other country\r\nWe will select the measure names accordingly, for example Mainland China to create the next line chart.\r\n Figure 30. Select Mainland China Exports and Imports from measure names filter\r\nThe above steps are repeated to create all the line charts for the remaining 4 countries Japan, Malaysia, Taiwan and United States.\r\nStep 6 Standardise the Y axis scale of the line charts\r\nThe overview of all 6 line charts as shown below did not have the same Y axis scale. It is important to standardise the scale in order for viewers not to misread the charts. Hence, we will standardise the Y axis scale.\r\n Figure 31. Visual of first preview on the dashboard after combining all the line charts\r\nWe found that China have the highest Y axis value (as shown below) as compared to the other country charts. We will proceed to edit and fixed the range of the y axis to be from 0 to 22,000,000 for all the line charts as shown below.\r\n Figure 32. preparing to edit Y Axis of all the charts\r\nWe will set the fixed range to be 0 to 22,000,000 for all the line charts.\r\n Figure 33. Fixed the scale to be within 0 to 22million\r\nWe will set the Tick Marks with the Major Tick Marks as Fixed from 0 to 5,000,000 and the Minor Tick Marks to be from 0 to 1,000,000 for all the charts. This allow the reader to be able to reference to the axis labels more easily as there is a huge range of values across all the 6 charts.\r\n Figure 34. Fixing the scale of Tick Marks for each chart\r\nStep 6 Creating a common legends for the line charts\r\nAs the 6 charts use red colour line for exports and blue colour line for imports. We will create a common legends for reader to reference to which will be used when building our dash board.\r\nWe will edit the title from measure names to Legends.\r\n Figure 35. preparing to edit title of legends\r\n Figure 36. Changing the name of the legends\r\nNext We will edit Alias on the Hong Kong worksheet and we will hide the legends on other charts and will use this as a common legends in our dash board.\r\n Figure 36. preparing to edit Alias\r\nWe will edit the Alias to Exports and Imports respectively.\r\n Figure 37. Changing Alias name to imports and exports respectively\r\nStep 7 Mark Label the Start of Q1 2019 and Q4 2020 for both imports and exports data\r\nWe want the reader of the chart to see the progress of the time series data from Jan 2019 to Dec 2020. Hence we will label the chart using the label function in the Marks pane which can be seen below. We will check show mark labels and selecting line ends.\r\n Figure 38. Setting show label on both ends of the line charts for imports and exports\r\nStep 8 Combining the 6 line charts into dash board\r\nwe will set up our dashboard and we will customize the size to 1700 x 800 as there are 6 Charts to fit in. We put in the required containers and move all the line charts into the dash board. Next a title is given for the Dashboard Merchandise Trade of Top Six Trading Countries Jan 2019 - Dec 2020 as seen below.\r\n Figure 39. customizing the dash board size and editing title of dash board\r\nStep 9 We will add in Country Flags to give the Dash board a better aesthetic look.\r\nIn the Dash Board, we will Use Image feature and set to floating, we placed the flag into the respective chart after download the flags images from Wikipedia. The view of the dash board are as follow after including the flag images.\r\n Figure 40. Dash Board Before adding flag images\r\n Figure 41. Dash Board after adding the flag images\r\nStep 10 to review and clean up the Dashboard to improve on the clarity\r\nThe title of the Individual chart seems to be repeating the title of the dashboard and this make it hard to read after combining them into dashboard. We will edit the title of the individual chart to just the country name.\r\n Figure 42. Dash Board after editing the individual chart title\r\nStep 11 to create a commentaries in the dashboard so that the viewers will have a summary on the key findings while referencing to the charts\r\nWe will do up the commentaries to provide the key highlights and findings from the visualisation. Annotation will be added to the chart for viewer to view the focus points.\r\nFirstly, we will add annotation to the focus point.\r\n Figure 43. Preparing to add annotation\r\nAnnotation is added to illustrate key findings in each chart.\r\n Figure 44. Adding annotation to show key highlights\r\nFormatting is done to the annotation to include dotted lines.\r\n Figure 45. Setting annotation formatting\r\nNext, we will edit the Dash Board Title to include commentaries to provide a brief summary of the charts.\r\n Figure 46. Editing title of Dash Board to include commentaries\r\nThe final dashboard is ready!\r\n Figure 47. The final dashboard version\r\n5.0 Derived Insights\r\nS/N\r\nMajor Observations\r\n1\r\nThe period of data used was from Jan 2019 to Dec 2020. Convid 19 was first reported on 31 Dec 2019 accordingly to sources from World Health organisation website. From the visualiation that we have created, it can be seen that Mainland China exports and imports was badly affected and this could be due to the lockdown in Wuhan China due to the severely of the Convid 19 situation. Subsequently in 2020 Q2 around April, China ended lockdown in Wuhan from sources from The New York Times. The exports and imports then start to pick up from Q2 2020 as many major China states open up when Convid 19 situation in China stabilised down.\r\n2\r\nConvid 19 subsequently spread to most parts of the world, Malaysia and United States merchandise trading were most likely to be affected from Convid 19 restrictions that follow which suggested that the exports and imports numbers start to fall from 2019 Q4 to 2020 Q2. United States seems to be doing better in its export tradings as compared to imports as it is likely their trading partners are facing Convid 19 restriction to export to United States.\r\n3\r\nFor Hong Kong, Japan and Taiwan, the Convid 19 situation are very much under control during this period and this could likely due to their people have been used to wearing masks in public which help to contain potential virus outbreak. This could be one of the possible reasons that their imports and exports trading activity have not been impacted during these period.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T23:09:42+08:00",
    "input_file": {}
  }
]
