[
  {
    "path": "posts/2021-05-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Sng Kah Leong",
        "url": "https://app.netlify.com/teams/danielsng07"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below.\r\n\r\n1.1 Clarity\r\nThe chart Title stated 2019-2020 duration but most of the graph show 2019 to 2021 and for Japan, the data shown is only for 2020. The chart title could have been more specific to mentioned that this data is for import and export trades of the six countries.\r\nThe dual x axis is not of equal scale and this may create misrepresentation visually.\r\nY axis show month of period, but the months wasn’t shown in the y axis and this create confusion which period is the months being used and there is 2021 data being included\r\nThe x axis scale are not consistent for import and export. For example, for Hong Kong, the export is in scale of millions and import are in scale of thousands\r\nPoor choice of chart used as area chart doesn’t look clear when import and export data are combined and overlap each other. This result in difficulty in interpreting the data\r\nThere are three type of colours appearing in some of the charts (for example mainland china and Malaysia) despite the legends only show two colours. This create confusion on the colour not stated in the legend and what is this colour for.\r\nThere is a lack of meaning in the charts as we couldn’t see the pattern of the import and exports\r\n1.2 Aesthetic\r\nPoor use of colour, the muddy yellow doesn’t look appealing and didn’t mix very well with the blue colour\r\nExport and import are repeated over all charts and make the charts all look very cramp altogether\r\nThe countries name are not layout properly and not align in the middle of the graph it is representing\r\nThe countries name font are bigger than the title of the chart\r\nThe measure names in the legend should not be there as it represent no meaning to the viewer\r\nThere is a lack of guidelines or marker on the axis to clearly label the data\r\n2.0 Alternative Design\r\n2.1 Clarity\r\nClearer title to illustrate what the charts are presenting on the 6 countries export and import data\r\nTo provide a clear illustration using same scale for the import and export data for x axis\r\nAll the charts to show consistent data for comparison from Jan 2019 to Dec 2020 for y axis\r\nUsing a line chart which WILL present time series data more Clearly\r\nTrade data are usually more seasonal and quarter data may help to show the trends\r\n2.2 Aesthetic\r\nUse of two colour, one to represent import and one to represent export to make viewing more clearer and consistent\r\nAnnotations are used to emphasize key observations. (when imports or exports volume drop)\r\nColour is used to bring to attention different categories (blue for import, red for export)\r\nY-axis is formatted to same scale\r\n3.0 Proposed Visualisation\r\nPlease view the interactive visualisation on Tableau Public here remember to create link here\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T01:56:02+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
